app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "category", "publishdate", "description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "price" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["price", 26.0], ["updated_at", "2021-10-22 07:28:20.884411"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)